{"talks": [{"title": {"en": "Breakfast & Registration"}, "start": "2023-06-02T07:00:00Z", "end": "2023-06-02T09:00:00+01:00", "room": 2}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-02T07:00:00Z", "end": "2023-06-02T09:00:00+01:00", "room": 1}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-02T07:00:00Z", "end": "2023-06-02T09:00:00+01:00", "room": 3}, {"code": "LAAP8N", "title": "sktime - python toolbox for time series: time series classification, regression, clustering, with modular time series distances and kernels", "abstract": "sktime is a widely used scikit-learn compatible library for learning with time series. sktime is easily extensible by anyone, and interoperable with the pydata/numfocus stack.\r\n\r\nThis tutorial explains how to use sktime for three learning tasks with independent instances of time series: time series classification, regression, clustering. It also explains their close connection to time series distances, kernels, and time series alignment, and how to flexibly combine such estimators to classifiers, regressors, clusterers with custom distances/kernels or feature extraction steps.\r\n\r\nThis is a continuation of the sktime introductory tutorial at pydata global 2021.", "speakers": ["9AQUVH"], "submission_type_id": 2, "track": null, "start": "2023-06-02T09:00:00+01:00", "end": "2023-06-02T10:30:00+01:00", "room": 2, "featured": false}, {"code": "RMUQBB", "title": "A dive into Hyperparameter Optimization", "abstract": "The tutorial aims to introduce the audience to the power of Hyperparameter Optimization. It will help them learn; how using simple python libraries one can make a huge difference in their ML model behavior.\r\n\r\nWe start with understanding the importance of hyperparameters, and the different distributions they are selected from. We then review some basic methods of optimizing hyperparameters, moving on to distributed methods and then to bayesian optimization methods. We'll use these algorithms hands-on, and play around with search spaces. We'll try out packages like Hyperopt, Dask, Optuna, to tune hyperparameters.\r\n\r\nThis tutorial will help beginner-level ML practitioners and working professionals use these methods in their applied ML tasks. They will be able to enhance the model quality and tune hyperparameters for bulky experiments more effectively.\r\n\r\n**Prior Knowledge Expected** - Basic Python, a very basic understanding of Machine learning.\\\r\n**Good to have** - worked with libraries like scikit-learn(just knowing `model.fit()` should be enough)", "speakers": ["MLDNVX"], "submission_type_id": 2, "track": null, "start": "2023-06-02T09:00:00+01:00", "end": "2023-06-02T10:30:00+01:00", "room": 3, "featured": false}, {"code": "PLT9AR", "title": "From zero to a working ML system with only Python, free serverless services and FTI pipelines", "abstract": "We will build an operational ML system to predict air quality in London. Instead of a single monolithic ML pipeline, we will build a more manageable system as 3 FTI pipelines: a Feature pipeline, a Training pipeline, and an Inference pipeline, connected together by a feature store. The feature pipeline scrapes new data and provides historical data (air quality observations and weather forecasts), The  training pipeline produces a model using the air quality observations and features. The inference pipeline takes weather forecasts and predicts air quality for London, visualized in a UI. The system will be hosted on free serverless services - Modal, Hugging Face Spaces, and Hopsworks. It will be a continually improving ML system that keeps collecting more data, making better predictions, and provides a hindcast with insights into its historical performance.", "speakers": ["JSPGHB"], "submission_type_id": 2, "track": null, "start": "2023-06-02T09:00:00+01:00", "end": "2023-06-02T10:30:00+01:00", "room": 1, "featured": false}, {"title": {"en": "Break"}, "start": "2023-06-02T09:30:00Z", "end": "2023-06-02T11:00:00+01:00", "room": 3}, {"title": {"en": "Break"}, "start": "2023-06-02T09:30:00Z", "end": "2023-06-02T11:00:00+01:00", "room": 2}, {"title": {"en": "Break"}, "start": "2023-06-02T09:30:00Z", "end": "2023-06-02T11:00:00+01:00", "room": 1}, {"title": {"en": "Break"}, "start": "2023-06-02T09:30:00Z", "end": "2023-06-02T11:00:00+01:00", "room": 3}, {"code": "DBN37P", "title": "From Passive to Active: Exploring the Benefits of Active Learning in Data Science", "abstract": "Active Learning is a powerful technique in the field of data science that enables efficient use of labelling resources. In this 90-minute-long hands-on tutorial, we will provide a step-by-step guide on how to apply basic Active Learning techniques for a document classification problem.\r\n\r\nThe tutorial will begin with an introduction to Active Learning, followed by a brief discussion of its cost and time savings benefits. Next, we will implement clustering to select the first batch of training data. Then, we will train a document classification model and analyse fundamental Active Learning concepts such as diversity, isolation, and model uncertainty. We will compare different metrics to select the best points for annotation.\r\n\r\nFinally, we will evaluate the model's performance and compare the results of Active Learning with random annotation. Throughout the tutorial, attendees will have the opportunity to work on their implementation and receive assistance.\r\n\r\nBy the end of this tutorial, attendees will better understand the principles of Active Learning and how to apply them to their own supervised learning problems, enabling them to make more efficient use of their labelling resources.", "speakers": ["M83PTE"], "submission_type_id": 2, "track": null, "start": "2023-06-02T11:00:00+01:00", "end": "2023-06-02T12:30:00+01:00", "room": 3, "featured": false}, {"code": "ARRWM7", "title": "Entering the Forest with TensorFlow - An intro", "abstract": "This 90-minute tutorial provides an introduction to using TensorFlow for building random forest models. The tutorial will begin with an overview of the random forest algorithm and its advantages in the context of machine learning. Next, participants will learn how to implement a random forest model using TensorFlow's high-level API, Keras. The tutorial will cover important concepts such as model architecture, hyperparameter tuning, and training and evaluation techniques. Additionally, participants will learn how to use TensorFlow's TensorBoard to visualize and monitor their models during training. The tutorial will conclude with a discussion of best practices and tips for improving the performance of random forest models. By the end of the tutorial, participants will have gained a solid understanding of how to use TensorFlow to build powerful and accurate random forest models.", "speakers": ["CZH3J3"], "submission_type_id": 2, "track": null, "start": "2023-06-02T11:00:00+01:00", "end": "2023-06-02T12:30:00+01:00", "room": 2, "featured": false}, {"code": "RLWBLY", "title": "An Introduction to Polars", "abstract": "[Polars](https://www.pola.rs) is a next generation data-frame library which aims to be fast, efficient, composable and lazy! This introductory tutorial will take you through the basics of getting started with polars in Python. We will demonstrate the out the box multi-core efficiencies, by composing advanced filters and joins, before comparing with the traditional pandas workflows. As a finale we will look at some lazy processing when applying polars to large scale data-sets.", "speakers": ["RU9FKJ"], "submission_type_id": 2, "track": null, "start": "2023-06-02T11:00:00+01:00", "end": "2023-06-02T12:30:00+01:00", "room": 1, "featured": false}, {"title": {"en": "Lunch"}, "start": "2023-06-02T11:30:00Z", "end": "2023-06-02T13:30:00+01:00", "room": 2}, {"title": {"en": "Lunch"}, "start": "2023-06-02T11:30:00Z", "end": "2023-06-02T13:30:00+01:00", "room": 1}, {"title": {"en": "Lunch"}, "start": "2023-06-02T11:30:00Z", "end": "2023-06-02T13:30:00+01:00", "room": 3}, {"code": "EWRRQP", "title": "Hands-on Intro to developing Explainability for Recommendation Systems", "abstract": "Over the last decade, the commercial use of recommendation engines/systems by business has grown substantially, enabling the flexible and accurate recommendation of items/services to users. Examples of popular recommenders include (to name a few) movies, videos and books recommendation engines offered by Netflix, Youtube and Amazon respectively. \r\n\r\nIn general, most recommender systems are typically “black-box” algorithms trained to provide inference of relevant items to users using techniques such as collaborative or content-based filtering models or hybrid models. The algorithms used in these systems are broadly opaque, thus making the predicted recommendations lack full interpretability/explainability. Making recommenders explainable is very essential, as they try to provide transparency and address the question of why were particular items recommended by the engine to users/system designers. \r\n\r\nOver the last few years there has been a growing area of research and development in explainable recommendation systems. Explainable recommendations systems are generally classified as Post-hoc (i.e. explainability is done post-recommendation) or Intrinsic (explainability is integrated into the recommender model) approaches. This workshop will provide a hands-on implementation of some of these approaches.", "speakers": ["NXRJ98"], "submission_type_id": 2, "track": null, "start": "2023-06-02T13:30:00+01:00", "end": "2023-06-02T15:00:00+01:00", "room": 3, "featured": false}, {"code": "QV7RE3", "title": "Bring best practices to your messy data science team!", "abstract": "If part of your job is to constantly poke your fellow data scientist to isolate projects environments, updating requirements, cleaning code, writing consistent docstrings, etc., then you should definitely join us for this very hands-on tutorial with reproducibility, compliance, and consistency in mind", "speakers": ["YA8EYM"], "submission_type_id": 2, "track": null, "start": "2023-06-02T13:30:00+01:00", "end": "2023-06-02T15:00:00+01:00", "room": 1, "featured": false}, {"code": "NYCBRN", "title": "Building an End-to-End Open-Source Modern Data Platform for Biomedical Data", "abstract": "Join us for a 90-minute tutorial on how to build an end-to-end open-source modern data platform for biomedical data using Python-based tools. In this tutorial, we will explore the technologies related to data warehousing, data integration, data transformation, data orchestration, and data visualization. We will use open-source tools such as DBT, Apache Airflow, Openmetadata, and Querybook to build the platform. All materials will be available on GitHub for attendees to access.", "speakers": ["XESLCP"], "submission_type_id": 2, "track": null, "start": "2023-06-02T13:30:00+01:00", "end": "2023-06-02T15:00:00+01:00", "room": 2, "featured": false}, {"title": {"en": "Break & Snack"}, "start": "2023-06-02T14:00:00Z", "end": "2023-06-02T15:30:00+01:00", "room": 3}, {"title": {"en": "Break & Snack"}, "start": "2023-06-02T14:00:00Z", "end": "2023-06-02T15:30:00+01:00", "room": 1}, {"title": {"en": "Break & Snack"}, "start": "2023-06-02T14:00:00Z", "end": "2023-06-02T15:30:00+01:00", "room": 2}, {"code": "ZYE3EW", "title": "Delta Lake 101: How many water metaphors does it take to describe data?", "abstract": "Delta Lake is an open-source storage framework that enables the creation of a Lakehouse architecture using a variety of compute engines such as Spark, PrestoDB, Flink, Trino, and Hive from Python. Its high data reliability and optimized query performance make it an ideal solution for supporting big data use cases, including batch and streaming data ingestion, fast interactive queries, and machine learning.", "speakers": ["HL73VT", "D73X8U"], "submission_type_id": 2, "track": null, "start": "2023-06-02T15:30:00+01:00", "end": "2023-06-02T17:00:00+01:00", "room": 2, "featured": false}, {"code": "BPCUW8", "title": "MLflow workshop", "abstract": "In this tutorial, we will learn the basis of MLflow. After introducing the library and the problem it solved we will implement an end-to-end machine learning lifecycle using MLflow.", "speakers": ["WRWMUF"], "submission_type_id": 2, "track": null, "start": "2023-06-02T15:30:00+01:00", "end": "2023-06-02T17:00:00+01:00", "room": 3, "featured": false}, {"code": "SPPXKV", "title": "Martial Arts Meets Machine Learning: Recognizing Judo Throws with MMAction2", "abstract": "Object detection is arguably the most common Computer Vision task. It is applied to images and videos across various domains. However, action recognition is a tad different from object detection because it can be difficult to tell certain actions from a single image. It is hard to tell if a door is being opened or closed or tell what martial art technique is being executed from an image.\r\n\r\nIn this tutorial, the MMAction2 framework will be used to train an action recognition model to detect what Judo throws are being performed in videos. While it will be fun seeing Machine Learning techniques applied to Martial Arts, the knowledge and techniques applied can easily be generalized to other action recognition tasks where simple object detection does not suffice.", "speakers": ["88XHVV"], "submission_type_id": 2, "track": null, "start": "2023-06-02T15:30:00+01:00", "end": "2023-06-02T17:00:00+01:00", "room": 1, "featured": false}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-03T07:00:00Z", "end": "2023-06-03T09:00:00+01:00", "room": 4}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-03T07:00:00Z", "end": "2023-06-03T09:00:00+01:00", "room": 1}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-03T07:00:00Z", "end": "2023-06-03T09:00:00+01:00", "room": 2}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-03T07:00:00Z", "end": "2023-06-03T09:00:00+01:00", "room": 3}, {"code": "LCYVFM", "title": "Keynote: Large Language Models: From Prototype to Production", "abstract": "Keynote with Ines Montani", "speakers": ["KD7LW7"], "submission_type_id": 1, "track": null, "start": "2023-06-03T09:00:00+01:00", "end": "2023-06-03T09:45:00+01:00", "room": 2, "featured": false}, {"title": {"en": "Break & Snacks"}, "start": "2023-06-03T08:45:00Z", "end": "2023-06-03T10:15:00+01:00", "room": 1}, {"title": {"en": "Break & Snacks"}, "start": "2023-06-03T08:45:00Z", "end": "2023-06-03T10:15:00+01:00", "room": 3}, {"title": {"en": "Break & Snacks"}, "start": "2023-06-03T08:45:00Z", "end": "2023-06-03T10:15:00+01:00", "room": 2}, {"code": "QMAAFD", "title": "The Opinionated Python Stack I chose for my Company’s ML Projects and how I bundled it in a Project Generator", "abstract": "Have you ever struggled with choosing the right tools for your Machine Learning projects? As a Lead Data Scientist in a consulting firm, I faced this challenge repeatedly and finally converged to a small set of technologies which allow to build reliable and scalable projects with a great DX (Developer Experience). In this talk, I will share the key components of my ML stack, including DVC, Streamlit, FastAPI, Terraform and other powerful tools to streamline the development and experimentation processes. Through a live demo, I will finally show you the Project Generator I’ve built to encourage adoption of these technologies and to help Data Scientists focus on the ML itself rather than the \"plumbing\" around it. Attendees should have a basic understanding of Python and Machine Learning concepts.", "speakers": ["T3UW39"], "submission_type_id": 1, "track": null, "start": "2023-06-03T10:15:00+01:00", "end": "2023-06-03T10:55:00+01:00", "room": 3, "featured": false}, {"code": "SBPHGW", "title": "Building a data science solution for an NGO when you don’t know what infrastructure it will run on: a case study predicting tutor supply and demand mismatch", "abstract": "The Brilliant Club supports less advantaged students to access and succeed in the UK’s most competitive universities. They do this by mobilising the PhD community to support students in schools via their courses and tutoring programme. A challenge they face is being able to anticipate the tutor supply they need to meet the increasing demands of their programmes as they expand nationally. A team of six DataKind UK volunteers worked with The Brilliant Club to develop a way to forecast and visualise the mismatch between tutor supply and demand across the UK. This is a talk about how we collaboratively explored their data and built a valuable, new tool for them and, crucially, how we did so in a flexible, scalable way that provides them with immediate value but also will fit into their future use of digital and cloud-based tools. This talk is for people intrigued by deploying new, data-driven solutions in organisations that are only just maturing into the data space. No previous knowledge is required.", "speakers": ["8C378L"], "submission_type_id": 1, "track": null, "start": "2023-06-03T10:15:00+01:00", "end": "2023-06-03T10:55:00+01:00", "room": 1, "featured": false}, {"code": "VNZNNU", "title": "Causal modelling of agent-customer pairing outcomes to optimise call centre performance", "abstract": "Large scale call centres are the frontline of customer experience across many industries. Optimizing their operations is crucial for achieving better customer service. We model agent customer pairing as a “talent” allocation problem. In this talk, we discuss how we used uplift modelling to provide real time agent-customer pairings that drive a positive lift in overall interaction score (which can come from any arbitrary scoring function). We discuss the challenges of developing and deploying such models to make real-time interventions in call centres. Similar approaches can be used to drive uplift of any important business KPI with respect to an allocation decision.", "speakers": ["KEZLR9"], "submission_type_id": 1, "track": null, "start": "2023-06-03T10:15:00+01:00", "end": "2023-06-03T10:55:00+01:00", "room": 2, "featured": false}, {"code": "JEQWDN", "title": "Code Smells in Data Science: What can we do about them?", "abstract": "We all want to write cleaner code but usually don't know where to start. It also doesn't help that most guides available are written for software engineers and not data scientists.\r\n\r\nCode smells are a taxonomy and a well-defined set of instructions on how to identify typical antipatterns in your code and change them in a few steps.\r\n\r\nIn this talk, I will select a short list of typical code smells that frequently appear in data-intensive workflows and walk you through how to resolve them.", "speakers": ["CG8TK8"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:00:00+01:00", "end": "2023-06-03T11:40:00+01:00", "room": 3, "featured": false}, {"code": "TN3RLP", "title": "Large scale agent-based simulations: how to do it right, and how we used one to optimise fibre broadband rollout across the UK", "abstract": "What’s the optimal way to upgrade a broadband network to fibre? In this session we’ll talk about how we used actor-based simulations and discrete optimisation to build a planning tool that has not only optimised one of the biggest fibre upgrade operations in the UK, but also unlocked powerful scenario testing capabilities. We’ll go through how to architect scalable, agent-based simulations using only open-source libraries and Python, then take you on our journey (including pointing out pitfalls) towards optimising UK wide fibre broadband rollout.", "speakers": ["LSCNEB", "JRYYCX"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:00:00+01:00", "end": "2023-06-03T11:40:00+01:00", "room": 2, "featured": false}, {"code": "MEPVQK", "title": "Python for the Public Sector: How data science is being put to work for the public good", "abstract": "In this talk, I will take you on a rollercoaster tour of how data science is delivering for the public good at the Office for National Statistics’ Data Science Campus and beyond. Drawing on examples from the dozens of data scientists working at the Campus, you’ll find out how Python is improving the public sector already in a myriad of ways, from creating or improving national statistics, to forecasting the economy, to dealing with Covid-19, to evaluating efforts to tackle the gender pay gap. We’ll even see how a tweet by a food campaigner led to a huge effort to web-scrape budget brand offerings in UK supermarkets—analysis that made it onto every major UK news programme! And we’ll look ahead to the challenges, and potential, of Python for the public sector in the future.", "speakers": ["AQQWET"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:00:00+01:00", "end": "2023-06-03T11:40:00+01:00", "room": 1, "featured": false}, {"code": "DDMP83", "title": "Executives at PyData", "abstract": "Executives at PyData is a facilitated discussion session for executives and leaders to discuss challenges around designing and delivering successful data projects, organizational communication, product management and design, hiring, and team growth.\r\n\r\nWe'll announce the agenda at the start of the session, you can ask questions or raise issues to get feedback from other leaders in the room, NumFOCUS board members and Ian and James.\r\n\r\nOrganized by Ian Ozsvald (London) and James Powell (New York)", "speakers": ["RKMCL8"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:00:00+01:00", "end": "2023-06-03T11:40:00+01:00", "room": 4, "featured": false}, {"code": "9YZVZH", "title": "Unlocking the potential of multi-armed bandits for personalised recommendations in a data-poor environment", "abstract": "It’s not a secret that machine learning-based personal recommendations can help businesses to understand their customers better, and increase customer loyalty and engagement. Netflix, Youtube, and Amazon are just a few examples of success stories in this domain. These companies have all made extensive use of user-item preference data. However, what should companies with little or no such data do? During this presentation, I will share with you my own experience of applying multi-armed bandits in a data-poor environment, and provide an overview of the mistakes I made, the results I received, and the lessons I learned.", "speakers": ["WRKKJ7"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:45:00+01:00", "end": "2023-06-03T12:25:00+01:00", "room": 2, "featured": false}, {"code": "HPM8CQ", "title": "✨ fastAPI facts we wish we'd known beforehand. Spoiler: It's not about getting started.", "abstract": "An exchange of views on fastAPI in practice.\r\n\r\nFastAPI has become an integral part of the PyData ecosytem. FastAPI is great, it helps many engineers create REST APIs based on the OpenAPI standard and run them asynchronously. It has a thriving community and educational documentation. \r\n\r\nFastAPI does a great job of getting people started with APIs quickly.\r\n\r\nThis talk will point out some obstacles and dark spots that I wish we had known about before. In this talk we want to highlight solutions based on experience building a data hub in asset management.", "speakers": ["SBHMEA"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:45:00+01:00", "end": "2023-06-03T12:25:00+01:00", "room": 3, "featured": false}, {"code": "ECTZTY", "title": "Green software - building sustainable Python data analytics", "abstract": "Were you aware that the cloud infrastructure powering modern computing has a larger greenhouse gas footprint than commercial aviation? This talk is aimed at developers and data scientists who are concerned about the impact of their work on the environment and want to explore practical solutions to address this challenge. We will explain how greenhouse gas emissions are categorized and estimated for computing. We will also introduce approaches to developing more sustainable software and provide practical examples using Python data analytics.", "speakers": ["F7KSPW"], "submission_type_id": 1, "track": null, "start": "2023-06-03T11:45:00+01:00", "end": "2023-06-03T12:25:00+01:00", "room": 1, "featured": false}, {"title": {"en": "Lunch"}, "start": "2023-06-03T11:30:00Z", "end": "2023-06-03T13:30:00+01:00", "room": 3}, {"title": {"en": "Lunch"}, "start": "2023-06-03T11:30:00Z", "end": "2023-06-03T13:30:00+01:00", "room": 2}, {"title": {"en": "Lunch"}, "start": "2023-06-03T11:30:00Z", "end": "2023-06-03T13:30:00+01:00", "room": 1}, {"title": {"en": "Lightning Talks"}, "start": "2023-06-03T12:30:00Z", "end": "2023-06-03T14:30:00+01:00", "room": 2}, {"title": {"en": "Break & Snack"}, "start": "2023-06-03T13:30:00Z", "end": "2023-06-03T15:00:00+01:00", "room": 3}, {"title": {"en": "Break & Snack"}, "start": "2023-06-03T13:30:00Z", "end": "2023-06-03T15:00:00+01:00", "room": 2}, {"title": {"en": "Break & Snack"}, "start": "2023-06-03T13:30:00Z", "end": "2023-06-03T15:00:00+01:00", "room": 1}, {"code": "Z8KHQX", "title": "Event Driven Machine Learning", "abstract": "This talk focuses on the benefits of using an event-driven approach for machine learning products. We will cover the basics of event-driven architecture for software development and provide examples of how it can be applied for machine learning use cases. The talk will be accompanied by live examples and code for you to follow along, using open source tools such as *Apache Kafka*, *FastAPI* and *River*. By the end of the talk, you'll have a good understanding of the advantages of event-driven architectures, such as improved scalability and responsiveness. If you are a machine learning practitioner interested in exploring this topic, this talk is a great starting point in which we will cover the concepts, tools and common pitfalls of the event driven framework for machine learning products.", "speakers": ["8ZUPPH"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:00:00+01:00", "end": "2023-06-03T15:40:00+01:00", "room": 1, "featured": false}, {"code": "DCSQAX", "title": "Teach data science better (a discussion)", "abstract": "This discussion session is for educators to talk about how we teach data science in industry and academia. It'll be a guided discussion, we'll vote on the top topics to discuss at the start and then we'll work our way through problems, solutions and new ideas. Maybe we'll get to talk about ChatGPT, or using Jupyter, or when to \"teach in an IDE\", or how to balance lecture vs problem solving vs homework - all topics can be up for voting at the start.", "speakers": ["CZH3J3"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:00:00+01:00", "end": "2023-06-03T15:40:00+01:00", "room": 4, "featured": false}, {"code": "SFZLT7", "title": "Garbage in -> Pydantic -> you're golden!", "abstract": "[Pydantic](https://docs.pydantic.dev/) is a data validation library for Python that has seen massive adoption over the last few years - it's used by major datascience and ML libraries like [Spacy](https://spacy.io/usage/v3#features-types), [Huggingface](https://github.com/huggingface/transformers) and [jinja-ai](https://github.com/jina-ai/jina) - overall Pydantic is downloaded over 50m times a month!\r\n\r\nIn this talk Samuel Colvin, the creator of Pydantic will cover two subjects which have seen massive interest in recent years:\r\n\r\n* How Pydantic can be used to prepare data for processing thereby saving time and avoiding errors\r\n* The emergence of Rust as the go-to language for high performance python libraries - how this might go in the future, and the benefits and drawbacks of the trend", "speakers": ["AKHQ7M"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:00:00+01:00", "end": "2023-06-03T15:40:00+01:00", "room": 3, "featured": false}, {"code": "UJDNBU", "title": "Serverless Python Analytics at Petabyte scale using ArcticDB", "abstract": "At Man Group we ingest data of all shapes and sizes, from market prices to weather, ESG reporting to news media. Storing that data in a format that is useful both to researchers and to strategies trading more than a billion dollars is a unique technical challenge - on that has resulted in two iterations of our high-performance data storage product ArcticDB. The aim is nothing less than to bring the performance and analytical capabilities of a server infrastructure right into the Python client. With the client now available on Conda and PyPI. and the source published on GitHub, I want to take you on a tour of our database; the design rationale, the ups and downs of developing a new database while supporting a billion-dollar trading estate, and the lessons we've learned along the way.", "speakers": ["TYWTJ3"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:00:00+01:00", "end": "2023-06-03T15:40:00+01:00", "room": 2, "featured": false}, {"code": "88HLKZ", "title": "Mastering Great Expectations: Ensuring Data Quality in Your Data Pipelines.", "abstract": "Join me as we dive into the world of Great Expectations, an open-source tool that helps data driven teams ensure their pipelines deliver high-quality data. You will be introduced to the key concepts of Great Expectations, including data validation, documentation and lineage. Plus, I'll show you how to set up Great Expectations in a cloud environment, using Google Cloud Platform as an example. By the end of this talk, you'll have a solid understanding of how Great Expectations can improve the reliability and correctness of your datasets and transformations.", "speakers": ["BQMSC9"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:45:00+01:00", "end": "2023-06-03T16:25:00+01:00", "room": 2, "featured": false}, {"code": "7HKDG3", "title": "Language Models for Music Recommendation", "abstract": "Music streaming services like Spotify and youtube are famous for their recommendation systems and each service takes a unique approach to recommending and personalize content. While most users are happy with the recommendations provided, there are a section of users who are curious how and why a certain track is recommended. Complex recommendation systems take various factors like track metadata, user metadata, and play counts along with the track content itself. \r\n\r\nInspired by Andrej Karpathy to build an own GPT, we have to use Language Models to build our own music recommendation system.", "speakers": ["NHBW83", "E7BNUX"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:45:00+01:00", "end": "2023-06-03T16:25:00+01:00", "room": 1, "featured": false}, {"code": "D7HGQL", "title": "Pandas 2, Dask or Polars? Quickly tackling larger data on a single machine", "abstract": "Pandas 2 brings new Arrow data types, faster calculations and better scalability. Dask scales Pandas across cores. Polars is a new competitor to Pandas designed around Arrow with native multicore support. Which should you choose for modern research workflows? We'll solve a \"just about fits in ram\" data task using the 3 solutions, talking about the pros and cons so you can make the best choice for your research workflow. You'll leave with a clear idea of whether Pandas 2, Dask or Polars is the tool for your team to invest in.", "speakers": ["RKMCL8", "HJX9FR"], "submission_type_id": 1, "track": null, "start": "2023-06-03T15:45:00+01:00", "end": "2023-06-03T16:25:00+01:00", "room": 3, "featured": false}, {"code": "XLTMNR", "title": "The Future of MLOps: Embedding Active Learning into Your ML Model Development Pipelines", "abstract": "Join us for an insightful session on active learning and its applications in machine learning. You will learn how leading teams are embedding active learning into their ML pipelines and how to build your first active learning loop. This session is for ML engineers and data scientists (aspiring or practitioners) who want to stay updated on the latest techniques and learn how to implement active learning with open-source tools.", "speakers": ["7QKYX8"], "submission_type_id": 1, "track": null, "start": "2023-06-03T16:30:00+01:00", "end": "2023-06-03T17:10:00+01:00", "room": 1, "featured": false}, {"code": "B9DUV9", "title": "Discussing Higher Performance Python (Birds of a Feather session)", "abstract": "This discussion session is for anyone using Python for higher performance work. You probably use Pandas, NumPy, Polars, Dask, Vaex, Modin, cuDF or any of the related tools, you've got questions, you want to know what other people are using, what's pragmatic and where new opportunity might exist.\r\nThis will be a guided discussion, we'll vote on topics at the start of the session and then host Ian will work through the list.", "speakers": ["RKMCL8"], "submission_type_id": 1, "track": null, "start": "2023-06-03T16:30:00+01:00", "end": "2023-06-03T17:10:00+01:00", "room": 4, "featured": false}, {"code": "9WFUH3", "title": "Autoencoders for Time Series Clustering", "abstract": "AutoEncoders (AEs) are among the most popular techniques in modern machine learning. Thanks to their strong representation learning capability, they can be used not only to generate data, but also for many other tasks, e.g. clustering, dimensionality reduction and transfer learning. \r\n\r\nDespite their popularity, their application is usually advertised mostly for applications with static tabular (e.g. for recommender systems) and image data (e.g. for computer vision tasks). With this talk we will try to shed some light on a less well-known area of application, namely the use of AEs with time series data. After a brief introduction on AEs we will highlight challenges to their application in the time-series domain with a particular focus on clustering, features extraction and transfer learning. \r\n\r\nThe talk is for everyone with an interest in deep learning, time series and their intersection. Despite some working knowledge of applied machine learning (deep learning in particular) and time series analysis would be beneficial, the talk will be delivered in a format accessible to all data science practitioners.", "speakers": ["98Y7Q9", "N7CWUE"], "submission_type_id": 1, "track": null, "start": "2023-06-03T16:30:00+01:00", "end": "2023-06-03T17:10:00+01:00", "room": 2, "featured": false}, {"code": "PGVK3S", "title": "Unleashing the Power of dbt and Python for Modern Data Stack", "abstract": "This talk will introduce the PyData community to dbt and demonstrate how to leverage Python to unlock its full potential. Attendees will learn best practices for working with dbt, how to integrate it with other tools in their data stack, and how to use Python packages like fal to perform complex data analysis. With real-world examples and use cases, this talk will equip attendees with the tools to build a modern, scalable, and maintainable data infrastructure.", "speakers": ["LCM7FQ"], "submission_type_id": 1, "track": null, "start": "2023-06-03T16:30:00+01:00", "end": "2023-06-03T17:10:00+01:00", "room": 3, "featured": false}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-04T07:00:00Z", "end": "2023-06-04T09:00:00+01:00", "room": 2}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-04T07:00:00Z", "end": "2023-06-04T09:00:00+01:00", "room": 4}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-04T07:00:00Z", "end": "2023-06-04T09:00:00+01:00", "room": 3}, {"title": {"en": "Breakfast & Registration"}, "start": "2023-06-04T07:00:00Z", "end": "2023-06-04T09:00:00+01:00", "room": 1}, {"code": "EML3U9", "title": "Keynote: Research Software Engineering and other Research Technology roles", "abstract": "Software plays an increasingly critical role in research and over the past decade this has seen Research Software Engineering (RSE) emerge as a distinct role within both the academic and commercial research sectors. [First coined](https://www.software.ac.uk/blog/2016-08-17-not-so-brief-history-research-software-engineers-0) at a community workshop in 2012, \"Research Software Engineer\" gave a name to those researchers who had been spending most of their time writing software and brought together a community to establish a dedicated career pathway for the role within UK academia.\r\n\r\nOver the past decade the demand for RSEs has grown rapidly and the role has become well established in both academia and industry, with the number of RSE roles and RSE groups expanding rapidly year on year, sustainable career pathways for RSEs in place at many organisations, and a [professional society](https://society-rse.org/) for the role established. Recent years have also seen the emergence of other related Research Technology roles such as Research Data Scientists, Research Data Stewards, Research Application Managers and Community Managers.\r\n\r\nIn this talk Martin will give an overview of Research Software Engineering and related roles, and will examine the similarities and differences between these roles and their counterparts outside the research sector. Martin will describe the journey the community has made from naming a new role, to establishing a community of practice, to building a sustainable new profession.", "speakers": ["EQ9JKA"], "submission_type_id": 1, "track": null, "start": "2023-06-04T09:00:00+01:00", "end": "2023-06-04T09:45:00+01:00", "room": 2, "featured": false}, {"title": {"en": "Break"}, "start": "2023-06-04T08:45:00Z", "end": "2023-06-04T10:15:00+01:00", "room": 2}, {"title": {"en": "Break"}, "start": "2023-06-04T08:45:00Z", "end": "2023-06-04T10:15:00+01:00", "room": 3}, {"title": {"en": "Break"}, "start": "2023-06-04T08:45:00Z", "end": "2023-06-04T10:15:00+01:00", "room": 1}, {"code": "7SKYJ3", "title": "Building a skills extraction library using NLP tools", "abstract": "There is no publicly available data on the skills that are commonly required in UK online job adverts, despite this information being useful for a range of use cases. To address this, we have built an open source skills extraction python library using spaCy and huggingface. Our approach is twofold: we train a named entity recognition model to extract skill entities from job adverts then map them onto any standardised skills taxonomy. By applying this algorithm to a dataset of scraped online job adverts, we are then able to find skill similarities amongst occupations, and regional differences in skill requirements.", "speakers": ["J7LW7A", "PMXHWN", "8HQNEM"], "submission_type_id": 1, "track": null, "start": "2023-06-04T10:15:00+01:00", "end": "2023-06-04T10:55:00+01:00", "room": 1, "featured": false}, {"code": "TWWYUP", "title": "New Developments in Pandas and Dask Dataframes", "abstract": "We're in a new era of dataframe development.  Libraries like Arrow, Polars, DuckDB, Vaex, Modin, and others stretch the bounds of performance on what we think can be done with tabular data in Python.  These systems have great benchmarking results and generate significant buzz on social media.\r\n\r\nPandas, the community favorite, is also innovating, although with less buzz.  Structural improvements like Arrow data types, copy on write, and more bring the world's most popular dataframe library (55% of Python users) into significantly better performance and memory use.  Additionally Dask, a parallel computing library developed closely with Pandas, has also added new features in the last year, like memory-stable shuffling, task queueing, and with recent experiments in query optimization which we'll discuss as well.  \r\n\r\nIn this talk we'll highlight some of these new features and show the impact they make on speed and cost on real-world workloads, as well as a vision for future development.", "speakers": ["YRLTTF"], "submission_type_id": 1, "track": null, "start": "2023-06-04T10:15:00+01:00", "end": "2023-06-04T10:55:00+01:00", "room": 3, "featured": false}, {"code": "GHNZD9", "title": "Getting from data to insights with powerful XAI & DataViz open-source tool (inc. diving deep into shap’s TreeExplainer)", "abstract": "Have you ever wanted a standard and efficient process to approach new datasets? Do you want a systematic way of highlighting complex nonlinear or low frequency patters in your data?  \r\n\r\nIn this talk, I will share the open-source stack that I use to get efficiently extract interesting insights from any dataset. I will teach you how to use data visualisation, gradient boosted decision trees and XAI tools quickly find hidden patterns, to de-risk you projects early or debug your models.", "speakers": ["PTPYTK"], "submission_type_id": 1, "track": null, "start": "2023-06-04T10:15:00+01:00", "end": "2023-06-04T10:55:00+01:00", "room": 2, "featured": false}, {"code": "KPTQGL", "title": "Unconference: Is it GDPR 2.0? What is CRA and how can it affect you and OSS in general", "abstract": "The European Parliament proposed a Cyber Resilience Act - basically wants all software to have an “EC” stamp on it. There is a non-commercial craft out but it is still not enough to make sure open-source projects with limited resources are exempted from the Act. How will it affect the OSS ecosystem?", "speakers": ["FCP9FF"], "submission_type_id": 1, "track": null, "start": "2023-06-04T10:55:00+01:00", "end": "2023-06-04T11:35:00+01:00", "room": 4, "featured": false}, {"code": "GFHHGB", "title": "Data Storytelling through Visualization", "abstract": "Data is everywhere. It is through analysis and visualization that we are able to turn data into information that can be used to drive better decision making. Out-of-the-box tools will allow you to create a chart, but if you want people to take action, your numbers need to tell a compelling story. Learn how elements of storytelling can be applied to data visualization.", "speakers": ["DSEREM"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:00:00+01:00", "end": "2023-06-04T11:40:00+01:00", "room": 2, "featured": false}, {"code": "7S8GGF", "title": "From correlations to causality in machine learning– a gentle guide to causal inference", "abstract": "Today most conventional ML systems look to exploit correlations in data in order to draw inferences. However as we learned back in school Statistics class, correlation is not  causation. So when you need to know the ‘why’ behind a particular prediction, or why A outperforms B in an experiment, then relying on correlations is insufficient.  Furthermore some ML models are build purely for explainability and insight purposes rather than predictions, in order to understand how the world works so we could potentially make some kind of policy change, e.g. What if we had chosen a different strategy or tactic – would the outcome have been different, and if so, by how much? To answer these kinds of questions, you need to delve into the world of causality. \r\n\r\nThis talk is a gentle (and occasionally entertaining) introduction to the interdisciplinary field of causality and how it is starting to impact machine learning. You will learn what kinds of questions causal inference can answer, and how it can address some of the limitations of current explainable ML methods, under certain conditions. I draw upon use-cases drawn from financial services and marketing, and  I will show a short practical example of how combining human domain knowledge (intuitively via Graphical Causal Models) along with your data can sometimes unlock insights not recoverable by purely data driven approaches.", "speakers": ["TXMHBG"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:00:00+01:00", "end": "2023-06-04T11:40:00+01:00", "room": 3, "featured": false}, {"code": "QTLKVG", "title": "Web Data Extraction with Deep Learning", "abstract": "Extracting data from web pages is a problem which is not so well covered and researched compared to image or text classification, object detection or named entity recognition. But this problem is extremely exciting to look into and rewarding to work on, because web pages can be represented in so many ways: as a screenshot of a page, as it's text, as an HTML tree, as a sequence of elements with discrete and continuous properties, and in other ways. This leads to many diverse approaches, which often combine different input types and ways of data representation inside one model. In this talk we will explore several intriguing approaches for web data extraction, and see how one can come up with novel approaches and grow your model according to the task at hand.\r\nThis talk is intended for anyone with interest in neural networks. I hope it gives you inspiration and intuition for building deep learning models tailored to the structure of your data. This is applicable not only to web information extraction, but also to document extraction and other domains with structured text or image inputs.", "speakers": ["EBYSP8"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:00:00+01:00", "end": "2023-06-04T11:40:00+01:00", "room": 1, "featured": false}, {"code": "NGDWTX", "title": "Robot Holmes and the Vision-Language Murder Mysteries", "abstract": "We will follow master detective Robot Holmes on his way to solve one of his hardest cases so far - a series of mysterious murders in the city of MLington. The traces lead him to the Vision-Language part of town, which has been a quiet and tranquil place with few incidents until lately. For a few months the neighbourhood has been growing extensively and careless benchmark leaders are dropping dead at an alarming rate.\r\n\r\nRobot Holmes sets out to find the cause for this new development and will gather intel on some of the most notorious of the new citizens of the Vision-Language neighbourhood and find out what makes them tick.", "speakers": ["WDCFAV"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:45:00+01:00", "end": "2023-06-04T12:25:00+01:00", "room": 3, "featured": false}, {"code": "AQEHG7", "title": "How to build stunning Data Science Web applications in Python", "abstract": "This talk presents **Taipy, a new low-code Python package** that allows you to create complete Data Science applications, including graphical visualization and managing algorithms, pipelines, and scenarios.", "speakers": ["WSH7JW"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:45:00+01:00", "end": "2023-06-04T12:25:00+01:00", "room": 2, "featured": false}, {"code": "SSEFW9", "title": "Data work across Industries -  Discussion", "abstract": "This session will facilitate a discussion exploring the differences in data work between different industries, including eCommerce, Insurance, Cyber Security, and Finance.\r\n\r\nWe will discuss the challenges and opportunities of data work in each industry, as well as the skills and knowledge that data professionals may need, in order to be successful. We will cover Data Engineering and Data Science specifically, but this is an open forum for anyone to discuss data challenges in different industries.", "speakers": ["CNYMTC"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:45:00+01:00", "end": "2023-06-04T12:25:00+01:00", "room": 4, "featured": false}, {"code": "UULPBA", "title": "\"Unstructured\" terabyte-scale textual data processing in a distributed cluster", "abstract": "ChatGPT has reignited worldwide interest in text data, capturing the imaginations of thousands of developers, but how do we actually build large scale production pipelines for working with and processing this highly unstructured data?\r\n\r\nSQL is a great language for simple data modalities that fits in a database table, but when it comes to complex \"unstructured\" data, it is Python that really shines. In this talk, we show how easy it is to go from data storage to querying and processing large amounts of unstructured data using modern Python open-sourced tooling such as Ray, Daft and HuggingFace models.", "speakers": ["XLJZ78"], "submission_type_id": 1, "track": null, "start": "2023-06-04T11:45:00+01:00", "end": "2023-06-04T12:25:00+01:00", "room": 1, "featured": false}, {"title": {"en": "Lunch"}, "start": "2023-06-04T11:30:00Z", "end": "2023-06-04T13:30:00+01:00", "room": 3}, {"title": {"en": "Lunch"}, "start": "2023-06-04T11:30:00Z", "end": "2023-06-04T13:30:00+01:00", "room": 1}, {"title": {"en": "Lunch"}, "start": "2023-06-04T11:30:00Z", "end": "2023-06-04T13:30:00+01:00", "room": 2}, {"code": "USSF9S", "title": "PyData Organizers Meetup", "abstract": "We welcome all PyData Organizers to join us for an open discussion during lunch.", "speakers": [], "submission_type_id": 1, "track": null, "start": "2023-06-04T12:30:00+01:00", "end": "2023-06-04T13:30:00+01:00", "room": 4, "featured": false}, {"title": {"en": "Lightning Talks"}, "start": "2023-06-04T12:30:00Z", "end": "2023-06-04T14:30:00+01:00", "room": 2}, {"title": {"en": "Break & Snack"}, "start": "2023-06-04T13:30:00Z", "end": "2023-06-04T15:00:00+01:00", "room": 3}, {"title": {"en": "Break & Snack"}, "start": "2023-06-04T13:30:00Z", "end": "2023-06-04T15:00:00+01:00", "room": 1}, {"title": {"en": "Break & Snack"}, "start": "2023-06-04T13:30:00Z", "end": "2023-06-04T15:00:00+01:00", "room": 2}, {"code": "QGWV7W", "title": "Driving down the Memray lane - Profiling your data science work", "abstract": "When handling a large amount of data, memory profiling the data science workflow becomes more important. It gives you insight into which process consumes lots of memory. In this talk, we will introduce Mamray, a Python memory profiling tool and its new Jupyter plugin.", "speakers": ["FCP9FF"], "submission_type_id": 1, "track": null, "start": "2023-06-04T15:00:00+01:00", "end": "2023-06-04T15:40:00+01:00", "room": 1, "featured": false}, {"code": "JND97A", "title": "Actionable Machine Learning in the Browser with PyScript", "abstract": "PyScript brings the full PyData stack in the browser, opening up to unprecedented use cases for interactive data-intensive applications. In this scenario, the web browser becomes a ubiquitous computing platform, operating within a (nearly) _zero-installation_ & _server-less_ environment.\r\n\r\nIn this talk, we will explore how to create full-fledged interactive front-end machine learning applications using PyScript. We will dive into the the main features of the PyScript platform (e.g. _built-in Javascript integration_ and  _local modules_ ), discussing _new_ data & design patterns (e.g. _loading heterogeneous data in the browser_), required to adapt and to overcome the limitations imposed by the new operating environment (i.e. the browser).", "speakers": ["FFVVUW"], "submission_type_id": 1, "track": null, "start": "2023-06-04T15:00:00+01:00", "end": "2023-06-04T15:40:00+01:00", "room": 3, "featured": false}, {"code": "ZWHBKV", "title": "The Sound of Your Footsteps is a Digital Biomarker", "abstract": "This will be a gentle introduction to the world of clinical gait analysis and how your gait (a.k.a the way you walk) is a digital biomarker for predicting physical and cognitive health. We will talk about digital biomarker engineering from unconventional sources of data (footstep sounds for example). To demonstrate a real life application, I will briefly mention how the R&D team at MiiCare uses acoustic machine learning for fall risk assessment for older adults living alone at home and care homes across the UK. \r\n\r\nYou should join this talk if you are interested in digital health, digital biomarker engineering and applications of AI in social care.", "speakers": ["CBG3XN"], "submission_type_id": 1, "track": null, "start": "2023-06-04T15:00:00+01:00", "end": "2023-06-04T15:40:00+01:00", "room": 2, "featured": false}, {"title": {"en": "TBA- James Powell"}, "start": "2023-06-04T14:45:00Z", "end": "2023-06-04T16:25:00+01:00", "room": 1}, {"title": {"en": "TBA"}, "start": "2023-06-04T14:45:00Z", "end": "2023-06-04T16:25:00+01:00", "room": 2}, {"code": "MD8U73", "title": "Software Engineering Practices in Data Science", "abstract": "This discussion session focuses on exploring the application of software engineering practices in the field of data science. Join us to delve into essential aspects such as python packages, IDEs, testing, refactoring, and architecture that play a crucial role in building robust and scalable data science solutions. We will discuss how adopting software engineering principles can enhance the reliability, maintainability, and efficiency of data science projects. Whether you're a DS manager or practitioner, this session offers a platform to exchange insights, share experiences, and discover innovative approaches to integrating software engineering practices into the data science workflow.", "speakers": ["CG8TK8", "H97DTS"], "submission_type_id": 1, "track": null, "start": "2023-06-04T15:45:00+01:00", "end": "2023-06-04T16:25:00+01:00", "room": 4, "featured": false}, {"code": "JE8TT9", "title": "Synthetic data: what is it and why do we need it?", "abstract": "One of the biggest barriers to machine learning and data analytics is the difficulty to access high quality data. Synthetic data has been widely recognized as a promising remedy to this problem. It allows sharing, augmenting and de-biasing data for building performant and socially responsible ML systems. In this talk, I will overview the significant progress in the theory and methodology of synthetic data over the past five years. I will also introduce the open-source library, [Synthcity](https://github.com/vanderschaarlab/synthcity), which implements an array of cutting-edge synthetic data generators to address data scarcity, privacy, and bias. The participants will walk away with a deeper understanding of the theory and practice of synthetic data, an understanding of when which methods apply (or do not apply) to their specific use case, and be ready to apply them in hackathons, competitions, and their day-to-day work.", "speakers": ["WAYCSB"], "submission_type_id": 1, "track": null, "start": "2023-06-04T15:45:00+01:00", "end": "2023-06-04T16:25:00+01:00", "room": 3, "featured": false}, {"code": "WUYJPK", "title": "Deploying Real-Time Machine Learning Models Using Serverless AWS", "abstract": "In this presentation, I will show how to use AWS Lambda and API Gateway to deploy real-time machine learning models developed in Python. I will use these tools to create a serverless web endpoint and serve model predictions with high availability/scalability. These tools provide a relatively simple and cost-effective solution for data scientists and machine learning engineers looking to deploy models without the hassle of managing servers and without needing to rely on third parties. I will cover potential pitfalls to be aware of, such as Lambda's cold start delays and memory limitations. Through code examples and practical tips, attendees will gain a solid understanding of how to use serverless AWS to deploy and serve their own machine learning models at scale.", "speakers": ["U7GPFM"], "submission_type_id": 1, "track": null, "start": "2023-06-04T16:30:00+01:00", "end": "2023-06-04T17:10:00+01:00", "room": 3, "featured": false}, {"code": "8GNNXP", "title": "The 11 Types of Comedy and Large Language Models (LLMs)", "abstract": "This talk is about how advances in Large Language Models (LLMs) are helping make inroads into the 11 types of comedy. For many years most, but not all, types of humour were beyond the reach of automated systems. This talk is for those interested in comedy, how it is created, the state of the art in LLMs, and comedy datasets. This talk will include specific code examples as well as trying to be humorous in its own way. At the end the audience will have learnt how LLMs are changing the human/computer comedy landscape.", "speakers": ["ACEXQH"], "submission_type_id": 1, "track": null, "start": "2023-06-04T16:30:00+01:00", "end": "2023-06-04T17:10:00+01:00", "room": 2, "featured": false}, {"code": "JVZGVM", "title": "Building end-to-end internal analytics products using Python and open-source", "abstract": "This talk educates the audience on how to create end-to-end data products using the Python data ecosystem, from data integration to reporting, dashboards, apps, and surfacing insights.\r\n\r\nAfter analyzing the features found in popular proprietary analytics products across various verticals, this talk will demonstrate how data teams can use open-source libraries to create and deploy applications which are accessible to non-technical end users but hold distinct advantages over proprietary alternatives.", "speakers": ["QFR7JZ"], "submission_type_id": 1, "track": null, "start": "2023-06-04T16:30:00+01:00", "end": "2023-06-04T17:10:00+01:00", "room": 1, "featured": false}], "version": "0.35", "timezone": "Europe/London", "tracks": [], "rooms": [{"id": 1, "name": {"en": "Minories"}, "description": {}}, {"id": 2, "name": {"en": "Warwick"}, "description": {}}, {"id": 3, "name": {"en": "Salisbury"}, "description": {}}, {"id": 4, "name": {"en": "Beaumont"}, "description": {}}], "speakers": [{"code": "U7GPFM", "name": "Pedro Tabacof", "avatar": "https://london2023.pydata.org/media/avatars/pmctl9ck4kskkosg_v47wlpK.jpg"}, {"code": "AKHQ7M", "name": "Samuel Colvin", "avatar": null}, {"code": "SBHMEA", "name": "Alexander Hendorf", "avatar": null}, {"code": "98Y7Q9", "name": "vincenzo crescimanna", "avatar": null}, {"code": "N7CWUE", "name": "Valerio Bonometti", "avatar": null}, {"code": "WRWMUF", "name": "Theodore Meynard", "avatar": "https://london2023.pydata.org/media/avatars/MeynardTheodoreGYG_DR38hje.jpg"}, {"code": "KEZLR9", "name": "Petros Syntelis", "avatar": "https://london2023.pydata.org/media/avatars/Screenshot_2023-05-31_at_17.52.42_xfebcxr.png"}, {"code": "FCP9FF", "name": "Cheuk Ting Ho", "avatar": "https://london2023.pydata.org/media/avatars/Cheuk_Ting_Ho_CNEq97Q.JPG"}, {"code": "J7LW7A", "name": "India Kerle", "avatar": "https://london2023.pydata.org/media/avatars/_DSC3781_IulcegA.JPG"}, {"code": "PMXHWN", "name": "Liz Gallagher", "avatar": "https://london2023.pydata.org/media/avatars/_DSC3774_fave_crop_TfyWuJP.JPG"}, {"code": "PTPYTK", "name": "Raphaël Lüthi", "avatar": "https://london2023.pydata.org/media/avatars/4702.3000_small_0oRMoSY.jpg"}, {"code": "YA8EYM", "name": "Gabriel Harris", "avatar": "https://london2023.pydata.org/media/avatars/1678713167882_wDPtrKY.jpeg"}, {"code": "BQMSC9", "name": "Carsten Frommhold", "avatar": "https://london2023.pydata.org/media/avatars/carsten02_8c0b2iV.jpg"}, {"code": "T3UW39", "name": "Yannick Wolff", "avatar": "https://london2023.pydata.org/media/avatars/Photos_Sicara_LZPJBy0.jpeg"}, {"code": "WDCFAV", "name": "Johannes Kolbe", "avatar": "https://london2023.pydata.org/media/avatars/IMG_20200508_134855_268_YprooIu.jpg"}, {"code": "NXRJ98", "name": "Ade Idowu", "avatar": "https://london2023.pydata.org/media/avatars/Ades-Profile-Image_f4ZX5ZP.jpeg"}, {"code": "RU9FKJ", "name": "jonny edwards", "avatar": "https://london2023.pydata.org/media/avatars/05_-_JE0011.JPG_IzJTI7Z.jpg"}, {"code": "LSCNEB", "name": "James Schofield", "avatar": "https://london2023.pydata.org/media/avatars/me_VfLARBH.png"}, {"code": "JSPGHB", "name": "Jim Dowling", "avatar": "https://london2023.pydata.org/media/avatars/Jim-Dowling_r9Cp0GY.jpg"}, {"code": "RKMCL8", "name": "Ian Ozsvald", "avatar": "https://london2023.pydata.org/media/avatars/headsbodyhot_2017_big_J9HI0Os.jpg"}, {"code": "7QKYX8", "name": "Frederik Hvilshøj", "avatar": "https://london2023.pydata.org/media/avatars/image_64_q2RMKup.png"}, {"code": "EBYSP8", "name": "Konstantin Lopukhin", "avatar": "https://london2023.pydata.org/media/avatars/avatar-new-small_kiSCCsr.jpg"}, {"code": "8ZUPPH", "name": "Natan Mish", "avatar": "https://london2023.pydata.org/media/avatars/Screenshot_2023-06-01_at_11.29.32_ALuC44A.png"}, {"code": "WAYCSB", "name": "Zhaozhi Qian", "avatar": "https://london2023.pydata.org/media/avatars/Zhaozhi_photo_sq_61HhmZN.png"}, {"code": "XLJZ78", "name": "Jay Chia", "avatar": "https://london2023.pydata.org/media/avatars/jay_photo_RAAvMiw.jpeg"}, {"code": "JRYYCX", "name": "Tristan West", "avatar": "https://london2023.pydata.org/media/avatars/tristan-west-photo_AbYYjaY.jpg"}, {"code": "MLDNVX", "name": "Tanay Agrawal", "avatar": "https://london2023.pydata.org/media/avatars/1608965603402_u7XOB7F.jpeg"}, {"code": "F7KSPW", "name": "Mark Pinkerton", "avatar": "https://london2023.pydata.org/media/avatars/1598442300760_VbJwT9A.jpeg"}, {"code": "CNYMTC", "name": "John Carney", "avatar": "https://london2023.pydata.org/media/avatars/linkedin_DFGJXMO.png"}, {"code": "WSH7JW", "name": "Florian Jacta", "avatar": "https://london2023.pydata.org/media/avatars/Photo_Florian_bis_itFnQdw.jpg"}, {"code": "CZH3J3", "name": "Lisa Carpenter", "avatar": null}, {"code": "WRKKJ7", "name": "Maria Matskevichus", "avatar": null}, {"code": "HJX9FR", "name": "Giles Weaver", "avatar": "https://london2023.pydata.org/media/avatars/tigermoth_z497yhr.jpg"}, {"code": "YRLTTF", "name": "Matthew Rocklin", "avatar": "https://www.gravatar.com/avatar/8749ec52cee260c4c1f67f2dec29d957"}, {"code": "8HQNEM", "name": "Jack Vines", "avatar": "https://london2023.pydata.org/media/avatars/Screenshot_2020-10-30_at_14.40.05_dBTAzi4.png"}, {"code": "CG8TK8", "name": "Laszlo Sragner", "avatar": "https://www.gravatar.com/avatar/3933927d7d111383c8aeffdb70b83f7e"}, {"code": "TYWTJ3", "name": "William Dealtry", "avatar": null}, {"code": "EQ9JKA", "name": "Martin O'Reilly", "avatar": "https://london2023.pydata.org/media/avatars/martin-o-reilly_t1Q0z64.jpeg"}, {"code": "ACEXQH", "name": "Sam Joseph", "avatar": null}, {"code": "KD7LW7", "name": "Ines Montani", "avatar": "https://london2023.pydata.org/media/avatars/Ines_OHLz1b2.jpeg"}, {"code": "9AQUVH", "name": "Sagar Mishra", "avatar": "https://london2023.pydata.org/media/avatars/sagar_C21A61r.jpg"}, {"code": "AQQWET", "name": "Arthur Turrell", "avatar": "https://london2023.pydata.org/media/avatars/profile_edit_112_pp_AZ5n2vi.jpeg"}, {"code": "QFR7JZ", "name": "Leo Anthias", "avatar": null}, {"code": "D73X8U", "name": "Eoin O'Flanagan", "avatar": null}, {"code": "HL73VT", "name": "Holly Smith", "avatar": "https://london2023.pydata.org/media/avatars/Headshot_-_wfh_SKYRRZc.JPG"}, {"code": "LCM7FQ", "name": "Meder Kamalov", "avatar": "https://london2023.pydata.org/media/avatars/1595512072323_nQTYdMt.jpg"}, {"code": "XESLCP", "name": "Alberto Labarga", "avatar": "https://london2023.pydata.org/media/avatars/1606075402983_B3crypQ.jpeg"}, {"code": "H97DTS", "name": "Matteo Latinov", "avatar": "https://london2023.pydata.org/media/avatars/MatteoLatinov_profile_pic_sS0r4nE.jpeg"}, {"code": "NHBW83", "name": "Nischal", "avatar": "https://london2023.pydata.org/media/avatars/photo_2023-03-12_15.39.47_ayvUiFa.jpeg"}, {"code": "DSEREM", "name": "Marysia Winkels", "avatar": "https://london2023.pydata.org/media/avatars/dogdatascience_wI8Etuc_NFqwPAo.jpeg"}, {"code": "88XHVV", "name": "Habeeb Shopeju", "avatar": null}, {"code": "8C378L", "name": "Adam Hill", "avatar": "https://london2023.pydata.org/media/avatars/profile_square_ZiVHp7p.jpg"}, {"code": "CBG3XN", "name": "Debayan Das", "avatar": "https://london2023.pydata.org/media/avatars/dp_01_bg_removed-for-pydata_DBAybDj.png"}, {"code": "TXMHBG", "name": "Steve Goodman", "avatar": "https://london2023.pydata.org/media/avatars/image001_9Ra8qIY.jpg"}, {"code": "M83PTE", "name": "Mate Timar", "avatar": "https://london2023.pydata.org/media/avatars/custom_resized_4114dadb-0bae-450e-9b25-8acbb017f64c_x7kTaQN.png"}, {"code": "E7BNUX", "name": "Raghotham S", "avatar": null}, {"code": "FFVVUW", "name": "Valerio Maggio", "avatar": "https://london2023.pydata.org/media/avatars/me_kaesiwJ.jpg"}]}